network_sec.org
* Sql注入
** 系统库
| information_schema |   |   |
| performance_schema |   |   |
| mysql              |   |   |
| sys                |   |   |
** sql语法
*** 基本操作
| 登陆数据库       | mysql -uroot -ppassword -h 地址         |
| 列出数据库       | show databases;                        |
| 选中数据库       | use 数据库;                              |
| 列出选中数据库的表 | show tables;                           |
*** 查询操作
| 查询选中表的数据 | select 字段 from 表 ;           |
| 限制查询        | select 字段 from 表 where 表达式; |
| 合并查询        | select 字段 from 表 where 表达式1 union select * from 表 where 表达式2 |
注意 合并查询的字段数要相等
| 排序 | order by 字段 |

**** 查询host_summary表中,字段host=127.0.0.1与host=localhost的数据
#+begin_src sql
select host from host_summary where host='127.0.0.1' union select statements from host_summary where statements='0';
#+end_src

**** order by可以用来猜测表的字段数
当报错的时候证明字段不存在
