network_sec.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-21 日 18:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="唐璜铂金" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9ea43c2">1. Sql注入</a>
<ul>
<li><a href="#org5647128">1.1. 系统库</a></li>
<li><a href="#org3525a05">1.2. sql语法</a>
<ul>
<li><a href="#orge00463a">1.2.1. 基本操作</a></li>
<li><a href="#org568a75d">1.2.2. 查询操作</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org9ea43c2" class="outline-2">
<h2 id="org9ea43c2"><span class="section-number-2">1.</span> Sql注入</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org5647128" class="outline-3">
<h3 id="org5647128"><span class="section-number-3">1.1.</span> 系统库</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">information<sub>schema</sub></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">performance<sub>schema</sub></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">mysql</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">sys</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org3525a05" class="outline-3">
<h3 id="org3525a05"><span class="section-number-3">1.2.</span> sql语法</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orge00463a" class="outline-4">
<h4 id="orge00463a"><span class="section-number-4">1.2.1.</span> 基本操作</h4>
<div class="outline-text-4" id="text-1-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">登陆数据库</td>
<td class="org-left">mysql -uroot -ppassword -h 地址</td>
</tr>

<tr>
<td class="org-left">列出数据库</td>
<td class="org-left">show databases;</td>
</tr>

<tr>
<td class="org-left">选中数据库</td>
<td class="org-left">use 数据库;</td>
</tr>

<tr>
<td class="org-left">列出选中数据库的表</td>
<td class="org-left">show tables;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org568a75d" class="outline-4">
<h4 id="org568a75d"><span class="section-number-4">1.2.2.</span> 查询操作</h4>
<div class="outline-text-4" id="text-1-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">查询选中表的数据</td>
<td class="org-left">select 字段 from 表 ;</td>
</tr>

<tr>
<td class="org-left">限制查询</td>
<td class="org-left">select 字段 from 表 where 表达式;</td>
</tr>

<tr>
<td class="org-left">合并查询</td>
<td class="org-left">select 字段 from 表 where 表达式1 union select * from 表 where 表达式2</td>
</tr>
</tbody>
</table>
<p>
注意 合并查询的字段数要相等
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">排序</td>
<td class="org-left">order by 字段</td>
</tr>
</tbody>
</table>
</div>

<ol class="org-ol">
<li><a id="org2b15bb5"></a>查询host<sub>summary表中,字段host</sub>=127.0.0.1与host=localhost的数据<br />
<div class="outline-text-5" id="text-1-2-2-1">
<div class="org-src-container">
<pre class="src src-sql">select host from host_summary where host='127.0.0.1' union select statements from host_summary where statements='0';
</pre>
</div>
</div>
</li>

<li><a id="org71a8e54"></a>order by可以用来猜测表的字段数<br />
<div class="outline-text-5" id="text-1-2-2-2">
<p>
当报错的时候证明字段不存在
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 唐璜铂金</p>
<p class="date">Created: 2024-01-21 日 18:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>